mariopartyrd/marioparty4/src/REL/m409Dll/main.c
    object->data = HuMemDirectMallocNum(HEAP_HEAP, 6, HU_MEMNUM_OVL);
    var_r29 = (s16 *)object->data;
    var_r29[0] = 1;
    var_r30 = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M409, 0x0D), HU_MEMNUM_OVL));
    object->mdlId[0] = fn_1_5A18(var_r30, 0x800, 10.0f, 0x40, 0x40);
    fn_1_5FBC(object->mdlId[0], fn_1_5408);
    Hu3DModelLayerSet(object->mdlId[0], 5);
    var_r30 = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M409, 0x0E), HU_MEMNUM_OVL));
    object->mdlId[1] = fn_1_5A18(var_r30, 0x400, 2.0f, 0, 0);
    fn_1_5FBC(object->mdlId[1], fn_1_55E0);
    fn_1_5FF4(object->mdlId[1], 1);
    Hu3DModelLayerSet(object->mdlId[1], 5);
    HuAudFXListnerSetEX(&Hu3DCamera->pos, &Hu3DCamera->up, 10000.0f, 566.6667f, 0.0f, 300.0f, 300.0f);
    object->objFunc = fn_1_F70;
}

void fn_1_F70(OMOBJ *object)
{
    s16 *sp8;
    s16 temp_r3;
    s16 temp_r3_2;
    s32 var_r31;

    sp8 = (s16 *)object->data;
    switch (fn_1_2454(7)) {
        case 1:
            if (lbl_1_bss_6 == 0) {
                lbl_1_bss_6 = 1;
                WipeCreate(WIPE_MODE_IN, WIPE_TYPE_NORMAL, 0x3C);
            }
            if (WipeStatGet() == 0) {
                fn_1_2414(7, 2);

                for (var_r31 = 0; var_r31 < 4; var_r31++) {
                    omVibrate(var_r31, 0xC8, 6, 6);
                }
            }
            break;
        case 2:
            if (fn_1_10E8(object) != 0) {
                fn_1_2414(7, 3);
            }
            break;
        case 3:
            switch (fn_1_2454(0x60)) {
                case 0x40:
                    break;
                case 0x20:
                    fn_1_2098(object);
                    break;
            }
            break;
        case 4:
            if (fn_1_1B74(object) != 0) {
                fn_1_2414(7, 5);
                return;
            }
            break;
        case 5:
            lbl_1_bss_0 = 1;
            break;
    }
}

s8 fn_1_10E8(OMOBJ *object)
{
    Vec sp8;
    HU3DMODEL *temp_r31;
    f32 var_f26;
    f32 var_f27;
    f32 temp_f29;
    f32 temp_f28;
    f32 temp_f30;
    f32 var_f31;
    s8 var_r29;
    unkStruct3 *temp_r30;

    temp_r31 = &Hu3DData[lbl_1_bss_DC->mdlId[4]];
    temp_r30 = (unkStruct3 *)object->data;
    if (lbl_1_bss_A != 0) {
        var_r29 = fn_1_524();
    }
    switch (lbl_1_bss_8) { /* irregular */
        case -1:
            if ((HuPadBtnDown[0] & 0x100) != 0) {
                lbl_1_bss_8 = 0;
            }
            break;
        case 0:
            Hu3DModelAttrReset(lbl_1_bss_DC->mdlId[1], HU3D_MOTATTR_PAUSE);
            if (lbl_1_bss_C == 0.0f) {
                fn_1_3840();
                sp8.x = 1520.0f;
                sp8.y = 0.0f;
                sp8.z = -1200.0f;
                lbl_1_data_BC = HuAudFXEmiterPlay(0x554, &sp8);
                HuAudFXEmiterPlay(0x559, &sp8);
            }
            lbl_1_bss_C += 0.004f;
            if (lbl_1_bss_C >= 1.0f) {
                lbl_1_bss_C = 1.0f;
                lbl_1_bss_8 = 0x63;
            }
            else if (lbl_1_bss_C > 0.2f) {
                lbl_1_bss_A = 1;
            }
            var_f31 = sind(90.0f * lbl_1_bss_C);
            var_f27 = 1520.0f;
            var_f26 = -1030.0f;
            temp_f30 = var_f27 + (var_f31 * (var_f26 - var_f27));
            Hu3DModelPosSet(lbl_1_bss_DC->mdlId[4], temp_f30, 0.0f, -1200.0f);
            Hu3DModelPosSet(lbl_1_bss_DC->mdlId[1], temp_f30, 0.0f, -1200.0f);
            if (lbl_1_data_BC != ~0) {
                sp8.x = temp_f30;
                sp8.y = 0.0f;
                sp8.z = -1200.0f;
                HuAudFXEmiterUpDate(lbl_1_data_BC, &sp8);
            }
            var_f31 = 1.2f * lbl_1_bss_C;
            if ((var_f31 >= 1.0f) && lbl_1_data_BC != ~0) {
                HuAudFXEmiterPlay(0x555, &sp8);
                sp8.x += 200.0f;
                HuAudFXEmiterPlay(0x55E, &sp8);
                HuAudFXStop(lbl_1_data_BC);
                lbl_1_data_BC = -1;
            }
            if (var_f31 >= 1.0f) {
                var_f31 = 0.0f;
            }
            else {
                var_f31 = sind(90.0f + 90.0f * var_f31);
            }
            Hu3DMotionSpeedSet(lbl_1_bss_DC->mdlId[4], 2.0f * var_f31);
            if (lbl_1_bss_C > 0.5f) {
                var_f31 = 2.0f * (9.0f * (1.0f - lbl_1_bss_C));
            }
            else {
                var_f31 = 9.0f;
            }
            fn_1_44F0(lbl_1_bss_E0->mdlId[0], 0.0f, 0.0f, 0.0f, 0, var_f31);
            if ((lbl_1_bss_C > 0.7f) && (lbl_1_bss_C < 0.9f)) {
                var_f31 = (lbl_1_bss_C - 3.5f);
                if (++lbl_1_bss_10 > (var_f31 * 10.0f)) {
                    lbl_1_bss_10 = 0.0f;
                    temp_f30 = 190.0f + temp_r31->pos.x;
                    temp_f29 = 20.0f + temp_r31->pos.y;
                    temp_f28 = 95.0f + temp_r31->pos.z;
                    var_f31 = 1.0f - (lbl_1_bss_C - 3.5f);
                    fn_1_4FFC(lbl_1_bss_E0->mdlId[1], temp_f30, temp_f29, temp_f28, (u8)(2.0f * var_f31));
                    temp_f30 = 370.0f + temp_r31->pos.x;
                    fn_1_4FFC(lbl_1_bss_E0->mdlId[1], temp_f30, temp_f29, temp_f28, (u8)var_f31);
                    temp_f30 = 490.0f + temp_r31->pos.x;
                    fn_1_4FFC(lbl_1_bss_E0->mdlId[1], temp_f30, temp_f29, temp_f28, (u8)var_f31);
                }
            }
            if (++lbl_1_bss_14 > 1) {
                lbl_1_bss_14 = 0;
                fn_1_44F0(lbl_1_bss_E0->mdlId[0], 190.0f + temp_r31->pos.x, 15.0f, temp_r31->pos.z + 95.0f, 1, 1);
                fn_1_44F0(lbl_1_bss_E0->mdlId[0], 370.0f + temp_r31->pos.x, 15.0f, temp_r31->pos.z + 95.0f, 1, 1);
                fn_1_44F0(lbl_1_bss_E0->mdlId[0], 490.0f + temp_r31->pos.x, 15.0f, temp_r31->pos.z + 95.0f, 1, 1);
                fn_1_44F0(lbl_1_bss_E0->mdlId[0], 190.0f + temp_r31->pos.x, 15.0f, temp_r31->pos.z - 95.0f, 1, 1);
                fn_1_44F0(lbl_1_bss_E0->mdlId[0], 370.0f + temp_r31->pos.x, 15.0f, temp_r31->pos.z - 95.0f, 1, 1);
                fn_1_44F0(lbl_1_bss_E0->mdlId[0], 490.0f + temp_r31->pos.x, 15.0f, temp_r31->pos.z - 95.0f, 1, 1);
            }
            break;
        case 99:
            if (var_r29 == 0) {
                return 0;
            }
            temp_r30->unk2 = MGSeqCreate(3, 0);
            MGSeqPosSet(temp_r30->unk2, 320.0f, 240.0f);
            lbl_1_bss_8 = 0x270F;
            break;
        default:
            if (MGSeqStatGet(temp_r30->unk2) == 0) {
                lbl_1_bss_8 = 0;
                return 1;
            }
            if ((lbl_1_data_C0 == -1) && ((MGSeqStatGet(temp_r30->unk2) & 0x10) != 0)) {
                lbl_1_data_C0 = HuAudSeqPlay(0x48);
            }
            break;
    }
    return 0;
}

