mariopartyrd/marioparty4/src/REL/m409Dll/main.c
s8 fn_1_1B74(OMOBJ *object)
{
    f32 temp_f30;
    f32 temp_f31;
    s16 temp_r27;
    s32 temp_r28;
    unkStruct4 *temp_r30;

    temp_r30 = (unkStruct4 *)object->data;
    switch (lbl_1_bss_8) {
        case 0:
            temp_r30->unk2 = MGSeqCreate(3, 1);
            MGSeqPosSet(temp_r30->unk2, 320.0f, 240.0f);
            HuAudSeqFadeOut(lbl_1_data_C0, 0x64);
            lbl_1_bss_16 = 0;
            lbl_1_bss_8 = 1;
            break;
        case 1:
            if (++lbl_1_bss_16 > 30) {
                lbl_1_bss_8 = 2;
            }
            break;
        case 2:
            if (fn_1_B80()) {
                lbl_1_bss_8 = 3;
            }
            break;
        case 3:
            fn_1_2414(0x80, 0x80);
            if (temp_r30->unk4 >= 0) {
                GWPlayerCoinWinAdd(temp_r30->unk4, 10);
                temp_r30->unk2 = MGSeqCreate(5, 3, GWPlayerCfg[temp_r30->unk4].character, -1, -1, -1);
                HuAudSStreamPlay(1);
            }
            else {
                temp_r30->unk2 = MGSeqCreate(3, 2);
                HuAudSStreamPlay(4);
            }
            MGSeqPosSet(temp_r30->unk2, 320.0f, 240.0f);
            lbl_1_bss_8 = 4;
            lbl_1_bss_16 = 0;
            break;
        case 4:
            lbl_1_bss_16++;
            if (MGSeqStatGet(temp_r30->unk2) == 0) {
                lbl_1_bss_8 = 5;
            }
            break;
        case 5:
            lbl_1_bss_16++;
#if VERSION_PAL
            if (lbl_1_bss_16 > 175.0f) {
#else
            if (lbl_1_bss_16 > 210.0f) {
#endif
                return 1;
            }
            break;
    }
    return 0;
}

void fn_1_2098(OMOBJ *object)
{
    HU3DMODEL *temp_r31;
    f32 var_f28;
    f32 var_f29;
    f32 var_f31;
    f32 var_f30;
    s32 var_r30;

    temp_r31 = &Hu3DData[lbl_1_bss_DC->mdlId[4]];
    if (fn_1_2454(0x18) != 0x18) {
        lbl_1_bss_18 += 0.008f;
        if (lbl_1_bss_18 >= 1.0f) {
            fn_1_2414(0x60, 0x40);
            Hu3DModelAttrSet(lbl_1_bss_DC->mdlId[4], HU3D_ATTR_DISPOFF);
            lbl_1_bss_18 = 1.0f;
        }
        var_f31 = sind(90.0f * lbl_1_bss_18);
        var_f29 = -1030.0f;
        var_f28 = -1880.0f;
        var_f30 = var_f29 + (var_f31 * (var_f28 - var_f29));
        Hu3DModelPosSet(lbl_1_bss_DC->mdlId[4], var_f30, 0.0f, -1200.0f);
        Hu3DMotionSpeedSet(lbl_1_bss_DC->mdlId[4], 3.0f * var_f31);
        var_f31 = (4.0f * (9.0f * lbl_1_bss_18));
        fn_1_44F0(lbl_1_bss_E0->mdlId[0], 0.0f, 0.0f, 0.0f, 0, var_f31);
        fn_1_44F0(lbl_1_bss_E0->mdlId[0], 190.0f + var_f30, 15.0f, 95.0f + temp_r31->pos.z, 1, 1);
        fn_1_44F0(lbl_1_bss_E0->mdlId[0], 370.0f + var_f30, 15.0f, 95.0f + temp_r31->pos.z, 1, 1);
        fn_1_44F0(lbl_1_bss_E0->mdlId[0], 490.0f + var_f30, 15.0f, 95.0f + temp_r31->pos.z, 1, 1);
    }
}

void fn_1_23EC(s16 arg0)
{
    unkStruct4 *var_r31;

    var_r31 = (unkStruct4 *)lbl_1_bss_E0->data;
    var_r31->unk4 = arg0;
}

void fn_1_2414(u16 arg0, u16 arg1)
{
    unkStruct4 *var_r31;

    var_r31 = (unkStruct4 *)lbl_1_bss_E0->data;
    var_r31->unk0 &= ~arg0;
    var_r31->unk0 |= arg1;
}

u16 fn_1_2454(u16 arg0)
{
    unkStruct4 *var_r31;

    var_r31 = (unkStruct4 *)lbl_1_bss_E0->data;
    return var_r31->unk0 & arg0;
}

static inline void unkInline(unkStruct4 *var_r31, s16 var_r29, s16 *var_r28, s16 arg3)
{
    var_r31[var_r29].unk2 = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M409, 0x02));
    var_r31[var_r29].unk4 = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M409, 0x03));
    Hu3DModelAttrSet(var_r31[var_r29].unk2, HU3D_MOTATTR_LOOP);
    Hu3DModelAttrSet(var_r31[var_r29].unk4, HU3D_MOTATTR_PAUSE);
    if (arg3) {
        Hu3DModelAttrSet(var_r31[var_r29].unk2, HU3D_ATTR_DISPOFF);
        Hu3DModelAttrSet(var_r31[var_r29].unk4, HU3D_ATTR_DISPOFF);
    }
    var_r31[var_r29].unk6 = Hu3DModelCreateFile(0x2001C);
    var_r31[var_r29].unk8 = Hu3DJointMotionFile(var_r31[var_r29].unk6, DATA_MAKE_NUM(DATADIR_M409, 11));
    var_r31[var_r29].unkA = Hu3DJointMotionFile(var_r31[var_r29].unk6, DATA_MAKE_NUM(DATADIR_M409, 12));
    Hu3DModelAttrSet(var_r31[var_r29].unk6, HU3D_MOTATTR_LOOP);
    Hu3DMotionSet(var_r31[var_r29].unk6, var_r31[var_r29].unk8);
    var_r31[var_r29].unkC = var_r29 + 3;
    if (arg3) {
        *var_r28 += (((rand8() << 8) | rand8()) % 4) + 2;
    }
    else {
        *var_r28 = 2;
    }
    fn_1_3988(&var_r31[var_r29], *var_r28, var_r29);
    Hu3DModelPosSet(var_r31[var_r29].unk2, var_r31[var_r29].unk18, 0.0f, -1200.0f);
    Hu3DModelPosSet(var_r31[var_r29].unk4, var_r31[var_r29].unk18, 0.0f, -1200.0f);
}

void fn_1_2484(OMOBJ *object)
{
    s16 var_r28; // ! - uninitialized
    s16 var_r29;
    unkStruct4 *var_r31;

    var_r31 = &lbl_1_bss_40[0];
    object->stat |= 0x100;
    object->mdlId[0] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M409, 0x00));
    object->mdlId[5] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M409, 0x08));
    Hu3DModelLayerSet(object->mdlId[0], 2);
    Hu3DModelLayerSet(object->mdlId[5], 2);
    object->mdlId[2] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M409, 0x05));
    object->mdlId[3] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M409, 0x06));
    Hu3DModelScaleSet(object->mdlId[2], 1.1f, 1.0f, 1.0f);
    Hu3DModelScaleSet(object->mdlId[3], 1.1f, 1.0f, 1.0f);
    Hu3DModelRotSet(object->mdlId[2], 0.2f * lbl_1_data_4C->rot.x, 0.85f * lbl_1_data_4C->rot.y, 0.0f);
    Hu3DModelRotSet(object->mdlId[3], 0.2f * lbl_1_data_4C->rot.x, 0.85f * lbl_1_data_4C->rot.y, 0.0f);
    Hu3DModelLayerSet(object->mdlId[2], 2);
    Hu3DModelLayerSet(object->mdlId[3], 2);
    lbl_1_bss_24.unkE = Hu3DTexScrollCreate(object->mdlId[2], "cr_kumo2");
    Hu3DTexScrollPosMoveSet(lbl_1_bss_24.unkE, -0.0002f, 0.0f, 0.0f);
    lbl_1_bss_24.unk10 = Hu3DTexScrollCreate(object->mdlId[3], "cr_kumo3");
    Hu3DTexScrollPosMoveSet(lbl_1_bss_24.unk10, -0.0003f, 0.0f, 0.0f);
    var_r29 = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M409, 0x0A));
    Hu3DModelLayerSet(var_r29, 0);
    object->mdlId[6] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M409, 0x07));
    Hu3DModelAttrSet(object->mdlId[6], HU3D_ATTR_ZWRITE_OFF);
    Hu3DModelScaleSet(object->mdlId[6], 1.1f, 1.0f, 1.0f);
    Hu3DModelRotSet(object->mdlId[6], 0.2f * lbl_1_data_4C->rot.x, 0.85f * lbl_1_data_4C->rot.y, 0.0f);
    Hu3DModelLayerSet(object->mdlId[6], 1);
    lbl_1_bss_24.unk12 = Hu3DTexScrollCreate(object->mdlId[6], "bg");
    lbl_1_bss_24.unk14 = 0.0f;
    object->mdlId[4] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M409, 0x01));
    object->mdlId[1] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M409, 0x04));
    Hu3DModelAttrSet(object->mdlId[4], HU3D_MOTATTR_LOOP);
    Hu3DModelPosSet(object->mdlId[4], 1660.0f, 0.0f, -1200.0f);
    Hu3DModelPosSet(object->mdlId[1], 1660.0f, 0.0f, -1200.0f);
    Hu3DModelLayerSet(object->mdlId[1], 6);
    Hu3DModelAttrSet(object->mdlId[1], HU3D_MOTATTR_PAUSE);

    unkInline(var_r31, 0, &var_r28, 0);
    for (var_r29 = 1; var_r29 < 4; var_r29++) {
        unkInline(var_r31, var_r29, &var_r28, 1);
    }

