mariopartyrd/marioparty4/src/REL/m409Dll/main.c
            for (var_r29 = 0, var_r31 = &lbl_1_bss_40[0]; var_r29 < 4; var_r29++, var_r31++) {
                if (var_r31->unkC < var_r22) {
                    var_r22 = var_r31->unkC;
                    var_r27 = var_r29;
                }

                for (var_r28 = 0, var_r31->unk20 = NULL; var_r28 < 4; var_r28++) {
                    if ((var_r31->unkC + 1) == lbl_1_bss_40[var_r28].unkC) {
                        var_r31->unk20 = &lbl_1_bss_40[var_r28];
                    }
                }
            }
            var_r31 = &lbl_1_bss_40[var_r27];
            var_r31->unkE = 0;

        loop:
            if (var_r31->unk20) {
                var_r31->unk20->unkE = 2 + (((rand8() << 8) | rand8()) % 4) + var_r31->unkE;
                var_r31 = var_r31->unk20;
                goto loop;
            }
            lbl_1_bss_24.unk1 = 1;
        }
    }
}

void fn_1_3840(void)
{
    s16 var_r31;

    if ((lbl_1_bss_24.unk0 == 0) && (fn_1_2454(7) != 4)) {
        lbl_1_bss_24.unk0 = 1;

        for (var_r31 = 0; var_r31 < 4; var_r31++) {
            lbl_1_bss_40[var_r31].unk0b = 1;
        }
        if (++lbl_1_bss_20 == 2) {

            for (var_r31 = 0; var_r31 < 4; var_r31++) {
                lbl_1_bss_40[var_r31].unkE += 3;
            }
            fn_1_2414(0x60, 0x20);
        }
        HuAudFXPlay(0x55F);
    }
}

void fn_1_3988(unkStruct4 *arg0, s16 arg1, s16 arg2)
{
    arg0->unk0b = 0;
    arg0->unkE = arg1;
    arg0->unk10 = 0.0f;
    arg0->unk18 = ((850.0f * arg0->unkC) - 370.0f);
    arg0->unk1C = ((850.0f * arg2) - 370.0f);
    arg0->unkC = arg2;
    if ((arg0->unkC >= 2) && (fn_1_2454(7) != 2)) {
        Hu3DModelAttrSet(arg0->unk2, HU3D_ATTR_DISPOFF);
        Hu3DModelAttrSet(arg0->unk4, HU3D_ATTR_DISPOFF);
        Hu3DModelAttrSet(arg0->unk6, HU3D_ATTR_DISPOFF);
    }
}

s32 fn_1_3AD8(s32 arg0, f32 arg8, f32 arg9, f32 argA, f32 argB, f32 argC, f32 argD)
{
    f32 sp1C;
    f32 temp;
    HU3DMODEL *temp_r31;
    f32 temp_f31;
    f32 temp_f30;
    f32 temp_f29;
    f32 temp_f28;
    f32 temp_f27;
    f32 temp_f26;
    s16 var_r29;
    unkStruct4 *var_r30;

    var_r30 = lbl_1_bss_24.unk4;
    if (!var_r30)
        return;

    for (var_r29 = 0; var_r29 < 2; var_r29++) {
        temp_r31 = &Hu3DData[var_r30->unk6];
        temp_f31 = temp_r31->pos.x;
        temp_f30 = 75.0f + temp_r31->pos.y;
        temp_f29 = temp_r31->pos.z;
        temp_f28 = arg8 + argB;
        temp_f27 = arg9 + argC;
        temp_f26 = argA + argD;
        temp = sqrtf((temp_f28 - temp_f31) * (temp_f28 - temp_f31) + (temp_f27 - temp_f30) * (temp_f27 - temp_f30)
            + (temp_f26 - temp_f29) * (temp_f26 - temp_f29));
        if (temp < 50.0f) {
            return 1;
        }
        sp1C = -((argA * argD) + (((arg9 * argC) + (((-temp_f31 * argB) + (arg8 * argB)) - (temp_f30 * argC))) - (temp_f29 * argD)))
            / ((argD * argD) + ((argB * argB) + (argC * argC)));
        if (sp1C >= 1.0f)
            continue;

        temp_f28 = arg8 + (argB * sp1C);
        temp_f27 = arg9 + (argC * sp1C);
        temp_f26 = argA + (argD * sp1C);
        temp = sqrtf((temp_f28 - temp_f31) * (temp_f28 - temp_f31) + (temp_f27 - temp_f30) * (temp_f27 - temp_f30)
            + (temp_f26 - temp_f29) * (temp_f26 - temp_f29));
        if (temp < 50.0f) {
            return 1;
        }
        var_r30 = var_r30->unk20;
        continue;
    }
    return 0;
}

void fn_1_40A4(Mtx arg0, Mtx arg1)
{
    arg1[0][0] = arg0[0][0];
    arg1[1][0] = arg0[0][1];
    arg1[2][0] = arg0[0][2];
    arg1[0][1] = arg0[1][0];
    arg1[1][1] = arg0[1][1];
    arg1[2][1] = arg0[1][2];
    arg1[0][2] = arg0[2][0];
    arg1[1][2] = arg0[2][1];
    arg1[2][2] = arg0[2][2];
    arg1[0][3] = 0.0f;
    arg1[1][3] = 0.0f;
    arg1[2][3] = 0.0f;
}

f32 fn_1_4120(f32 arg0, f32 arg1, f32 arg2, f32 arg3)
{
    f32 temp_f31;

    temp_f31 = 1.0f - arg3;
    return (arg2 * (arg3 * arg3)) + ((arg0 * (temp_f31 * temp_f31)) + (arg1 * (2.0f * temp_f31 * arg3)));
}

void fn_1_417C(void)
{

    if ((HuPadBtnDown[0] & 0x40) != 0) {
        lbl_1_bss_21 ^= 1;
    }
    if (lbl_1_bss_21 != 0) {
        if ((HuPadBtn[0] & 1) != 0) {
            CRot.y++;
        }
        if ((HuPadBtn[0] & 2) != 0) {
            CRot.y--;
        }
        if ((HuPadBtn[0] & 8) != 0) {
            CRot.x--;
        }
        if ((HuPadBtn[0] & 4) != 0) {
            CRot.x++;
        }
        Center.x += HuPadSubStkX[0];
        if ((HuPadBtn[0] & 0x20) != 0) {
            Center.y += HuPadSubStkY[0];
        }
        else {
            Center.z += HuPadSubStkY[0];
        }
        if ((HuPadBtn[0] & 0x400) != 0) {
            CZoom += 10.0f;
        }
        if ((HuPadBtn[0] & 0x800) != 0) {
            CZoom -= 10.0f;
        }
        if ((HuPadBtnDown[0] & 0x100) != 0) {
            OSReport("\nCZoom = %.2f \n", CZoom);
            OSReport("Center x = %.2f: y = %.2f: z = %.2f \n", Center.x, Center.y, Center.z);
            OSReport("CRot x = %.2f: y = %.2f: z = %.2f \n", CRot.x, CRot.y, CRot.z);
        }
    }
}

void fn_1_44F0(s16 arg0, f32 arg8, f32 arg9, f32 argA, s8 arg1, s16 arg2)
{
    Vec sp20;
    Vec sp14;
    unkStruct4 *sp10;
    GXColor spA;
    HU3DMODEL *temp_r30;
    f32 temp_f31;
    s16 var_r29;
    unkStruct5 *var_r31;

    temp_r30 = &Hu3DData[lbl_1_bss_DC->mdlId[4]];
    sp10 = (unkStruct4 *)temp_r30->hookData;
    if (arg1 == 0) {
        arg8 = 150.0f + temp_r30->pos.x;
        arg9 = 360.0f + temp_r30->pos.y;
        argA = temp_r30->pos.z;
    }

    for (var_r29 = 0; var_r29 < arg2; var_r29++) {
        switch (arg1) { /* irregular */
            case 0:
                sp20.x = arg8 + ((((rand8() << 8) | rand8()) % 41) - 20);
                sp20.z = argA + ((((rand8() << 8) | rand8()) % 41) - 20);
                sp20.y = arg9;
                sp14.x = 0.01f * ((((rand8() << 8) | rand8()) % 101) + 200);
                sp14.y = 0.01f * ((((rand8() << 8) | rand8()) % 101) + 200);
                sp14.z = 0.01f * ((((rand8() << 8) | rand8()) % 101) + 200);
                spA.r = spA.g = spA.b = (((rand8() << 8) | rand8()) % 33) + 32;
                spA.a = 0xFF;
                var_r31 = fn_1_58E0(arg0, &sp20, &sp14, 0.0f, &spA);
                if (!var_r31)
                    return;

                temp_f31 = (((rand8() << 8) | rand8()) % 361);
                var_r31->unk0.x = 2.0 + (3.0 * sind(temp_f31));
                var_r31->unk0.y = (0.1f * ((((rand8() << 8) | rand8()) % 31) + 40));
                var_r31->unk0.z = (3.5 * cosd(temp_f31));
                var_r31->unk28 = 0;
                var_r31->unk2A = ((((rand8() << 8) | rand8()) % 3) + 2);
                var_r31->unk18 = (f32)spA.r;
                var_r31->unk1C = (((((rand8() << 8) | rand8()) % 69) + 0x80) / (f32)(var_r31->unk2A * 0xE));
                var_r31->unk20 = 255.0f;
                var_r31->unk24 = (((((rand8() << 8) | rand8())) % 128 + 0x80) / (f32)(var_r31->unk2A * 0xE));
                break;
            case 1:
                sp20.x = arg8 + ((((rand8() << 8) | rand8()) % 41) - 20);
                sp20.z = argA + ((((rand8() << 8) | rand8()) % 41) - 20);
                sp20.y = arg9 + ((((rand8() << 8) | rand8()) % 41) - 20);
                sp14.x = 0.01f * ((((rand8() << 8) | rand8()) % 101) + 300);
                sp14.y = 0.01f * ((((rand8() << 8) | rand8()) % 101) + 300);
                sp14.z = 0.01f * ((((rand8() << 8) | rand8()) % 101) + 300);
                spA.r = 0xFF;
                spA.g = 0xDC;
                spA.b = 0x8C;
                spA.a = 0x80;
                var_r31 = fn_1_58E0(arg0, &sp20, &sp14, 0.0f, &spA);
                if (!var_r31)
                    return;

                var_r31->unk28 = 0;
                var_r31->unk2A = ((((rand8() << 8) | rand8()) % 3) + 2);
                var_r31->unk0.x = (0.1f * ((((rand8() << 8) | rand8()) % 11) + 30));
                var_r31->unk0.y = 0.0f;
                var_r31->unk0.z = (0.1f * ((((rand8() << 8) | rand8()) % 41) - 20));
                var_r31->unk20 = 32.0f;
                var_r31->unk24 = (32.0f / (var_r31->unk2A * 0xE));
                break;
        }
        var_r31->unk2C = arg1;
    }
}

void fn_1_4FFC(s16 arg0, f32 arg1, f32 arg2, f32 arg3, s16 arg4)
{
    Vec sp2C;
    Vec sp20;
    GXColor sp1A;
    s16 sp18;
    f32 temp_f31;
    s16 var_r30;
    unkStruct5 *temp_r31;

    for (var_r30 = 0; var_r30 < arg4; var_r30++) {
        sp2C.x = arg1 + ((((rand8() << 8) | rand8()) % 21) - 10);
        sp2C.y = arg2;
        sp2C.z = arg3 + ((((rand8() << 8) | rand8()) % 21) - 10);
        sp20.x = 0.1f * ((((rand8() << 8) | rand8()) % 31) + 10);
        sp20.y = 1.0f;
        sp20.z = 1.0f;
        sp1A.r = sp1A.g = sp1A.b = sp1A.a = 0xFF;
        temp_r31 = fn_1_58E0(arg0, &sp2C, &sp20, 0.0f, &sp1A);
        if (!temp_r31)
            break;

        temp_r31->unk4C = -1;
        temp_f31 = ((((rand8() << 8) | rand8()) % 81) - 40);
        temp_r31->unk0.x = (13.0 * cosd(temp_f31));
        temp_r31->unk0.y = 0.1f * ((((rand8() << 8) | rand8()) % 21) + 20);
        temp_r31->unk0.z = (9.0 * sind(temp_f31));
        temp_r31->unkC.x = (0.05f * temp_r31->unk0.x);
        temp_r31->unkC.z = (0.05f * temp_r31->unk0.z);
        temp_r31->unk18 = 500.0f;
        temp_r31->unk1C = ((((rand8() << 8) | rand8()) % 21) + 40);
    }
}

void fn_1_5408(HU3DMODEL *arg0, struct _unkStruct6 *arg1, Mtx arg2)
{
    s16 var_r29;
    GXColor *var_r30;
    unkStruct5 *var_r31;

    var_r29 = 0;
    var_r31 = arg1->unk18;
    var_r30 = arg1->unk24;

    for (; var_r29 < arg1->unk0; var_r29++, var_r31++, var_r30++) {
        if (var_r31->unk4E != 0) {
            switch (var_r31->unk2C) {
                case 0:
                    var_r31->unk0.y -= 0.1f;
                    var_r31->unk40.x += var_r31->unk0.x;
                    var_r31->unk40.y += var_r31->unk0.y;
                    var_r31->unk40.z += var_r31->unk0.z;
                    var_r31->unk18 += var_r31->unk1C;
                    if (var_r31->unk18 > 255.0f) {
                        var_r31->unk18 = 255.0f;
                    }
                    var_r30->r = var_r30->g = var_r30->b = var_r31->unk18;
                    break;
                case 1:
                    var_r31->unk40.x += var_r31->unk0.x;
                    var_r31->unk40.z += var_r31->unk0.z;
                    break;
            }
            var_r31->unk20 -= var_r31->unk24;
            if (var_r31->unk20 < 0.0f) {
                var_r31->unk20 = 0.0f;
            }
            var_r30->a = var_r31->unk20;
            var_r31->unk28++;
            if (var_r31->unk28 >= var_r31->unk2A) {
                var_r31->unk28 = 0;
                var_r31->unk4C++;
            }
            if (var_r31->unk4C >= (arg1->unk14 - 2)) {
                var_r31->unk4E = 0;
            }
        }
    }
}

void fn_1_55E0(HU3DMODEL *arg0, struct _unkStruct6 *arg1, Mtx arg2)
{
    GXColor *var_r30;
    f32 var_f31;
    f32 var_f30;
    s16 var_r29;
    s32 var_r28;
    unkStruct5 *var_r31;

    var_r29 = 0;
    var_r31 = arg1->unk18;
    var_r30 = arg1->unk24;

    for (; var_r29 < arg1->unk0; var_r29++, var_r31++, var_r30++) {
        if (var_r31->unk4E != 0) {
            var_r31->unk0.x -= var_r31->unkC.x;
            var_r31->unk0.y -= 0.2f;
            var_r31->unk0.z -= var_r31->unkC.z;
            if (var_r31->unk0.x < var_r31->unkC.x) {
                var_r31->unk0.x = var_r31->unkC.x;
            }
            if (var_r31->unkC.z < 0.0f) {
                var_f31 = -var_r31->unkC.z;
            }
            else {
                var_f31 = var_r31->unkC.z;
            }
            if (var_r31->unk0.z < 0.0f) {
                var_f30 = -var_r31->unk0.z;
            }
            else {
                var_f30 = var_r31->unk0.z;
            }
            if (var_f30 < var_f31) {
                var_r31->unk0.z = var_r31->unkC.z;
            }
            var_r31->unk40.x += var_r31->unk0.x;
            var_r31->unk40.y += var_r31->unk0.y;
            var_r31->unk40.z += var_r31->unk0.z;
            var_r31->unk18 -= var_r31->unk1C;
            if (var_r31->unk18 < 0.0f) {
                var_r31->unk18 = 0.0f;
            }
            if (var_r31->unk18 > 255.0f) {
                var_r28 = 0xFF;
            }
            else {
                var_r28 = (u8)var_r31->unk18;
            }
            var_r30->a = var_r28;
            if (0.0f == var_r31->unk18) {
                var_r31->unk4E = 0;
            }
        }
    }
}

void fn_1_57DC(HU3DMODEL *arg0, struct _unkStruct6 *arg1, Mtx arg2)
{
    Vec sp18;
    Vec spC;
    GXColor sp8;
    HU3DMODEL *temp_r30;
    unkStruct5 *temp_r31;

    temp_r30 = &Hu3DData[lbl_1_bss_DC->mdlId[4]];
    temp_r31 = arg1->unk18;
    if (temp_r31->unk4E == 0) {
        spC.x = spC.y = spC.z = 1.0f;
        sp8.r = sp8.g = sp8.b = sp8.a = 0xFF;
        fn_1_58E0(lbl_1_bss_E0->mdlId[2], &sp18, &spC, 0.0f, &sp8);
    }
    temp_r31->unk40.x = (60.0f + temp_r30->pos.x);
    temp_r31->unk40.y = (260.0f + temp_r30->pos.y);
    temp_r31->unk40.z = temp_r30->pos.z;
}

